InformationRegisters/СчетаУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СчетаУчетаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетСебестоимости</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачи</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДохода</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаЗабалансовый</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачиЗабалансовый</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасхода</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаУчетаНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	СправочникМенеджер = Справочники.Номенклатура;
	
	КлассификаторXML = РегистрыСведений.СчетаУчетаНоменклатуры.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	НаборЗаписей = РегистрыСведений.СчетаУчетаНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Очистить();                 
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		Наименование = СокрЛП(СтрокаТаблицыЗначений.Наименование);
		Код = СокрЛП(СтрокаТаблицыЗначений.Код);
		СтруктураСчетаУчетаНоменклатуры = Новый Структура;
		СтруктураСчетаУчетаНоменклатуры.Вставить("СчетУчета",ПланыСчетов.Хозрасчетный.НайтиПоКоду(СтрокаТаблицыЗначений.СчетУчета));
		СтруктураСчетаУчетаНоменклатуры.Вставить("СчетДоходов",ПланыСчетов.Хозрасчетный.НайтиПоКоду(СтрокаТаблицыЗначений.СчетДоходов));
		СтруктураСчетаУчетаНоменклатуры.Вставить("СчетУчетаЗабалансовый",ПланыСчетов.Хозрасчетный.НайтиПоКоду(СтрокаТаблицыЗначений.СчетУчетаЗабалансовый));
		СтруктураСчетаУчетаНоменклатуры.Вставить("СчетПередачи",ПланыСчетов.Хозрасчетный.НайтиПоКоду(СтрокаТаблицыЗначений.СчетПередачи));
		СтруктураСчетаУчетаНоменклатуры.Вставить("СчетПередачиЗабалансовый",ПланыСчетов.Хозрасчетный.НайтиПоКоду(СтрокаТаблицыЗначений.СчетПередачиЗабалансовый));
       		
		Если СтрокаТаблицыЗначений.Наименование = "Готовая продукция" Тогда
			СправочникСсылка = Справочники.Номенклатура.ГотоваяПродукция;
		ИначеЕсли СтрокаТаблицыЗначений.Наименование = "Материалы"  Тогда
			СправочникСсылка = Справочники.Номенклатура.Материалы;
		ИначеЕсли СтрокаТаблицыЗначений.Наименование = "МБП"  Тогда
			СправочникСсылка = Справочники.Номенклатура.МБП;
		ИначеЕсли СтрокаТаблицыЗначений.Наименование = "Товары"  Тогда
			СправочникСсылка = Справочники.Номенклатура.Товары;
		ИначеЕсли СтрокаТаблицыЗначений.Наименование = "Услуги"  Тогда
			СправочникСсылка = Справочники.Номенклатура.Услуги;
		Иначе 
			СправочникСсылка = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураСчетаУчетаНоменклатуры); 
		НоваяЗапись.Номенклатура = СправочникСсылка;
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли
